public/blog/pinebook-pro/pinebook-pro-setting-up-zram/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Pinebook Pro Setting Up Zram</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Pinebook Pro Setting Up Zram</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Pinebook Pro Setting Up Zram</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Enabling ZRAM</a>
<ul>
<li><a href="#headline-4">Checking if ZRAM is supported</a>
</li>
<li><a href="#headline-5">Setting up ZRAM</a>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Pinebook Pro Setting Up Zram
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>ZRAM is essentially compressed memory. Your system uses some of it&#39;s
CPU cycles to compress redundant data into a reserved area of your ram.
Think of it as swap space, but without writing to your drive.</p>
<p>
This is how to enable zram on ALARM/Manjaro ARM</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Enabling ZRAM
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Checking if ZRAM is supported
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>$ insmod | grep zram
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>Output: zram    ????? ?</span></span></code></pre></div>
</div>
<p>
If you get similar results, zram should be supported.</p>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Setting up ZRAM
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>
Load the zram module and create a 12GB zram device using <code>lzo-rle</code> for
compression. </p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>sudo modprobe zram <span style="color:#f92672">&amp;&amp;</span> sudo zramctl -a lzo-rle -s 12G zram0</span></span></code></pre></div>
</div>
<p>
Enabling swapping on the zram device</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>sudo mkswap /dev/zram0 <span style="color:#f92672">&amp;&amp;</span> sudo swapon /dev/zram0</span></span></code></pre></div>
</div>
<p>
Verify the 12GB of ZRAM is being used as swap</p>
<div class="src src-shell">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-shell" data-lang="shell"><span style="display:flex;"><span>free -h
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>total        used        free      shared  buff/cache   available
</span></span><span style="display:flex;"><span>Mem:         3.7Gi       429Mi     2.7Gi        30Mi       562Mi
</span></span><span style="display:flex;"><span>Swap:        11Gi          0B        11Gi</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
